---
kind: method
id: M:Autodesk.Revit.DB.ValueAtPointBase.Dispose
source: html/634fe4ca-cc7a-f91f-41ea-cd3795a6a63a.htm
---
# Autodesk.Revit.DB.ValueAtPointBase.Dispose Method

Releases all resources used by the ValueAtPointBase

## Syntax (C#)
```csharp
public void Dispose()
```